"""
           .          -       -'-·:.·               ...---::--.+++,---,+-- ''     --.   _:`   :'              .:'   :'
         `-           ;,     ___--            `__-/.--------.:        '/...:',_,   .:--`--   `.              :.    '.
         ;             _ ,_,`             `.:/:::.''''       --      '-::--.       -/::-`    :              __     :
         '.            '/:'            _-+-:.''         ·     _:- `·-·'      '---'  /-::::   /              /      /
         `.             '_,'        `.::-`             ·-       ' ''            ''-.:. `-::` /             :'      /
         _                ·-;.'   ,::.'               __        ·              '        '-:-:·           _-       :`
         |-                  ·,-+-,                  '-        '-              :.         '_/.          _-        _-
         '/       ,           ·_·                    :         ·                /           ':-       '-.          /
          :      ;  ,        __                     -'         :                --            ./.   `,.`           /
          .-      '' '     ·.·                     '-''''     ':                 .             ./-.-.·             /
           `:`      ,,-'. ·-              __   ''../...'''____-.                 ''              +·                /
            ':-       '·''·               /   __' .:         '/                  ·_              :'/              -.
             /.;;'       -               '-       :           /                ''_/''            -.':            '/
            ;;-·'·--''  ,               :        __          .:               _''':''''___`       : :' '' _''   '/
           '√'      ·--+♪              ':       `:           /.                   :       _-_     :  / -.-...  -:
          ';            ♪              :'       ::          .:               -    ::              :' :' :.`  ,:.
          :            ';              /       .-:          .:    -          -    :/              __  / ` _-:.
         --            :`             ':      ':.`         -.:    /          `    ::`         /   `:  :---`..
        ';             ';             /`      -./          : :    :          ''   /.:        -`    /  `:    -
       '♪            ,;'              /       : /         .: :   `:          ''   /':        '     /   :    ''
''   .--          _.'-                /      :-'/         /'':   -;               / :              :   -'   '-
 ♪·--'           '_;  _              .-      /`-:     '   :'':   //          _`   :'-        -`    :    _   -.
 ,·'           '..'. '.              .'     -.':.    .:  --'-:   /\          :-   / _'       ''    :    :   :    
   ._..'            ·,·              ;      /'':',,,,:/''/.'/-   /\`         ::   /  _       _     /    _  .-
     '''·-···-·----- ♪               ;     ··`.:.'''-:-.-:-:--   /\`         /-   / '_      -:     /    _  /
         :  '''''   :/-             '-::___:.-::/-/-::-.:-.:.-   //`       '.:/___:'':      ::    _-    _` /
        :'          //-.            .':/-__/-'../..':/'':''::-  `::`       '.:/''_:-':      :/    :`    __ .:`
       .:          ::/-:            - -::-.-/'''---+-+::/--+--' '-.'      :-//:-'-:-,:     :`:    /     __  '---
       /'         ':::-/            --//....   -:      /  .' '.--· _--++·`/./`:-'-/--/..''':':    /     .:'''.-/
      :.          :::-./            .` :'-...  -:  '_.'/  .          ''.'.h:-.u/::-''/''+++::·   `:     .:....·
     '-          -/.'.'/            -  __  '/''''  :_.': ''              ';----';''''-.:-.-::·   :'     _·
    '·   ;      ·/:'/.·/            '  .'   -://::-' ':'''               :'__' _:   '  ': :.`:··:/:  :  :`
   ';   .      '/:- -  /           ''   ___.-  ''-.'-:'''                :-.:. -:  -::''/ - .:--:'   /  /
  _<    .      :-·'   :·           ·      ·_,,,,,:-:-''                  :` .:''''./ ./:..` /-''/    /  /
 .,    ·      `" .-   ·/           ·                                     ':'--:::/:  '+-.`  .-.'':   :::-
'·/    /      /·  .'  '_           ·   .·. .                              '-4 ''''/.:_,,'   : ''--  `;/ `
:^:^   ;/;.   "'   |'  ':          -   ·____;                                ...--:--'     _· · -   -/
·:·;.  .2'-- '^    ·__··/     ·    :     .,,..                                '            _ '' :   ::
  __·   ;♪ --.'     ''..:                                                       ,,,       :` ''':   ♪
   ·__· ·,_'//      '' '--    -    -                                          _-   -      /  '' /  ·
      _,_';/':,  '  ''' _/                                                     ... .-     :.''  /  ..
         _:;;:/' '  '   ':.   :    ''                                                     :''  '/  :
            .:.:''--_____'/         :                                                    ./ '  -'  :
                '____...../.  .     ..:.                                                -: ''''-  ♪
                  __.      /        :  `--.                                          `-._  '''__  :
                    '..."  _.   ·   .'    '...'                                  `--;-'  _  _♪   `:
                         .../   :   ./.        ___'_       ~.               `-.--.''     `/'-/   ♪
                        ·...:'  :.   /'''''''.',,,/:;..:'''''''''''_'..-/`---'''''       -:''"   :
                            ':  :.   :-----"                              --::---------:-/`'':  _
                             /  :.'  -''''                                    ''''''''   /`'.:  :
                             ·- :-"  `-                                                 `- '   .-
                              :':.:.  "                                                 :''    :
                              '.:  -.'"                                                 /''.- .-
                                    ···                                                 --.♪  /
                                                                                          .:  ♪
                                                                                           :__
                                                                                            ·u·
"""
#Нахождение НОД и НОК двух чисел

#Уничтожитель похожих элементов в двух списках. Возвращает числа, которых нет в обоих списках
def pussy_destroyer(most, less):
    value = 1
    for i in range(len(less)):
        for j in most:
            if (less[i] == j):
                break
            if (less[i] != j and j == most[len(most)-1]):
                value *= less[i]
                break
    return value


#Разложение числа на простые множители:
def prime_factors(numeric):
    factors = []
    while (numeric > 1):
        if (numeric%2 == 0):
            factors.append(2)
            numeric /= 2
        elif (numeric%3 == 0):
            factors.append(3)
            numeric /= 3
        elif (numeric%5 == 0):
            factors.append(5)
            numeric /= 5
        elif (numeric%7 == 0):
            factors.append(7)
            numeric /= 7
        elif (numeric%11 == 0):
            factors.append(11)
            numeric /= 11
        elif (numeric%13 == 0):
            factors.append(13)
            numeric /= 13
        else:
            factors.append(numeric)
            return factors
    else:
        return factors

def nok_nod(numeric1, numeric2):
    nod_ = 1
    factors1 = prime_factors(numeric1)
    factors2 = prime_factors(numeric2)
    print (factors1)
    print (factors2)

    #НОД
    setA = set(factors1)
    setB = set(factors2)
    result = list(setA & setB)
    for i in result:
        nod_ *= i

    #Выбор большего числа для просчета НОК
    if (numeric1 >= numeric2):
        most, less = factors1, factors2
    else:
        most, less = factors2, factors1
    
    #Подсчет НОК и вывод результата
    nok_ = 1

    if (nod_ > 1):
        #Сперва перебираем произведение большего ссылая в nok_ для дальнейших действий
        for i in most:
            nok_ *= i 
        nok_ *= pussy_destroyer(most, less)

        return f"Заданы числа {numeric1} и {numeric2}. НОД этих чисел равен: {nod_}, НОК этих чисел равен: {nok_}."
    else:
        most += less
        for i in most:
            nok_ *= i
        return f"Заданы числа {numeric1} и {numeric2}: они взаимно простые. НОД этих чисел равен: {nod_}, НОК этих чисел равен: {nok_}."
